#include <iostream>
using namespace std;

void Greeting() {
	cout << "Разработчик: Сошнев Андрей Витальевич\n" "Группа : 415а\n" "Вариант : 8\n"
		"Лабораторная работа № 4. Символьные строки.\n"
		"Придумать три различных собственных механизма шифрования текста.\n"
		"Предусмотреть режим восстановления оригинального текста по\n"
		"зашифрованному. Программа должна самостоятельно определять, какой\n"
		"именно вариант был использован. Один из вариантов должен предоставлять\n"
		"пользователю ввести ключ(пароль), используемый при шифровании и\n"
		"расшифровке" << endl;
}